//基础数据映射
//预订单相关映射 start
//预订状态. -3 预订失败，0 预订成功，待付款，1 待匹配球友拼桌， 3 付款成功，待使用 4:已使用 6 预订取消 9 预订过期
var reserve_status_mapping={
    '-3':'预订失败',
    '0':'预订成功，待付款',
    '1':'待匹配球友拼桌',
    '3':'付款成功，待使用',
    '4':'已使用',
    '6':'预订取消',
    '9':'预订过期',
}
//预订单相关映射 end
//消息类别
var message_type ={
    1:"单点消息",
    2:"全体消息"
}
//消息类型
var message_category={
    1:"系统消息",
    2:"用户消息",
    3:"用户请求连接",
    4:"拒绝连接",
    5:"确认连接",
    6:"用户聊天消息",
    7:"系统公告"
}
//候补状态
var candidate_reserve_mapping={
    0:'候补中',
    1:'候补成功'
}
//技术等级 1 初级、2 中级、3 高级
var match_level_mapping={
    1:'初级',
    2:'中级',
    3:'高级'
}
//匹配单状态 0 正在匹配  1 预匹配，等待主单用户同意 2 匹配成功
var match_status_mapping={
    0 : '正在匹配',
    1 : '待同意',
    2 : '匹配成功'
}